1c/src/Reports/ДоходыПоАбонементам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ДоходыПоАбонементам</Name>
			<Comment>Отчёт по доходам от продажи абонементов за период</Comment>
		</Properties>
	</Report>
</MetaDataObject>

1c/src/Documents/ОформлениеАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОформлениеАбонемента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Reports/ДоходыПоАбонементам/Forms/ФормаОтчета/Ext/Form.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПринтФормы = "Доходы по абонементам";

	// Заголовок
	Шапка = ТабДок.Макеты.Добавить("Заголовок");
	Область = ТабДок.ПолучитьОбласть("Заголовок");

	Стиль = ТабДок.ПолучитьОбласть("R1");
	Стиль.Параметры.Текст = "Доходы по абонементам за период: "
		+ Формат(НачалоПериода, "ДЛФ=D") + " - " + Формат(КонецПериода, "ДЛФ=D");
	Стиль.Параметры.ЦветФона = WebЦвета.СветлоСерый;
	Стиль.Параметры.Шрифт = Новый Шрифт(, 12, Истина);

	// Получить данные
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| ОформлениеАбонемента.ВидАбонемента.Наименование КАК ВидАбонемента,
	| ОформлениеАбонемента.Клиент.Наименование КАК Клиент,
	| ОформлениеАбонемента.Дата КАК Дата,
	| ОформлениеАбонемента.Сумма КАК Сумма,
	| ОформлениеАбонемента.КоличествоПосещений КАК КоличествоПосещений,
	| ОформлениеАбонемента.Номер КАК Номер
	|ИЗ
	| Документ.ОформлениеАбонемента КАК ОформлениеАбонемента
	|ГДЕ
	| НЕ ОформлениеАбонемента.ПометкаУдаления
	| И ОформлениеАбонемента.Дата >= &НачалоПериода
	| И ОформлениеАбонемента.Дата <= &КонецПериода
	|УПОРЯДОЧИТЬ ПО
	| ОформлениеАбонемента.Дата";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	Выборка = Запрос.Выполнить().Выбрать();

	// Заголовки колонок
	НомСтр = 1;
	ТабДок.Область(НомСтр, 1).Текст = "№ документа";
	ТабДок.Область(НомСтр, 2).Текст = "Дата";
	ТабДок.Область(НомСтр, 3).Текст = "Клиент";
	ТабДок.Область(НомСтр, 4).Текст = "Вид абонемента";
	ТабДок.Область(НомСтр, 5).Текст = "Кол-во посещений";
	ТабДок.Область(НомСтр, 6).Текст = "Сумма (руб.)";

	Для Кол = 1 По 6 Цикл
		ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.СтальноЙСиний;
		ТабДок.Область(НомСтр, Кол).ЦветТекста = WebЦвета.Белый;
		ТабДок.Область(НомСтр, Кол).Шрифт = Новый Шрифт(, , Истина);
		ТабДок.Область(НомСтр, Кол).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;

	// Строки данных
	ИтогоСумма = 0;
	Пока Выборка.Следующий() Цикл
		НомСтр = НомСтр + 1;
		ТабДок.Область(НомСтр, 1).Текст = Выборка.Номер;
		ТабДок.Область(НомСтр, 2).Текст = Формат(Выборка.Дата, "ДЛФ=D");
		ТабДок.Область(НомСтр, 3).Текст = Выборка.Клиент;
		ТабДок.Область(НомСтр, 4).Текст = Выборка.ВидАбонемента;
		ТабДок.Область(НомСтр, 5).Текст = Выборка.КоличествоПосещений;
		ТабДок.Область(НомСтр, 5).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТабДок.Область(НомСтр, 6).Текст = Формат(Выборка.Сумма, "ЧЦ=10; ЧДЦ=2; ЧРД=,; ЧРГ= ");
		ТабДок.Область(НомСтр, 6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ИтогоСумма = ИтогоСумма + Выборка.Сумма;

		Если НомСтр % 2 = 0 Тогда
			Для Кол = 1 По 6 Цикл
				ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.АлисаСиний;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	// Итоговая строка
	НомСтр = НомСтр + 1;
	ТабДок.Область(НомСтр, 1, НомСтр, 5).Объединить();
	ТабДок.Область(НомСтр, 1).Текст = "ИТОГО:";
	ТабДок.Область(НомСтр, 1).Шрифт = Новый Шрифт(, , Истина);
	ТабДок.Область(НомСтр, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(НомСтр, 6).Текст = Формат(ИтогоСумма, "ЧЦ=10; ЧДЦ=2; ЧРД=,; ЧРГ= ");
	ТабДок.Область(НомСтр, 6).Шрифт = Новый Шрифт(, , Истина);
	ТабДок.Область(НомСтр, 6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Для Кол = 1 По 6 Цикл
		ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.ЗолотоЙ;
	КонецЦикла;

	// Авторазмер колонок
	ТабДок.АвтоШиринаКолонок = Истина;

	ТабличныйДокумент = ТабДок;

КонецПроцедуры

#КонецОбласти
